abedra.org
*** Web Mode
    :PROPERTIES:
    :CUSTOM_ID: web-mode
    :END:

    #+begin_src emacs-lisp
      (setq web-mode-style-padding 2)
      (setq web-mode-script-padding 2)
      (setq web-mode-markup-indent-offset 2)
      (setq web-mode-css-indent-offset 2)
      (setq web-mode-code-indent-offset 2)

      (add-to-list 'auto-mode-alist '("\\.hbs$" . web-mode))
      (add-to-list 'auto-mode-alist '("\\.erb$" . web-mode))
      (add-to-list 'auto-mode-alist '("\\.html$" . web-mode))
    #+end_src
*** Ruby
    Turn on =autopair= for Ruby. Identify additional file
    names/extensions that will trigger =ruby-mode= when loaded.
    #+begin_src emacs-lisp
      (add-hook 'ruby-mode-hook
                (lambda ()
                  (autopair-mode)))

      (add-to-list 'auto-mode-alist '("\\.rake$" . ruby-mode))
      (add-to-list 'auto-mode-alist '("\\.gemspec$" . ruby-mode))
      (add-to-list 'auto-mode-alist '("\\.ru$" . ruby-mode))
      (add-to-list 'auto-mode-alist '("Rakefile" . ruby-mode))
      (add-to-list 'auto-mode-alist '("Gemfile" . ruby-mode))
      (add-to-list 'auto-mode-alist '("Capfile" . ruby-mode))
      (add-to-list 'auto-mode-alist '("Vagrantfile" . ruby-mode))
      (add-to-list 'auto-mode-alist '("Guardfile" . ruby-mode))
    #+end_src
*** YAML
    Add additional file extensions that trigger =yaml-mode=.
    #+begin_src emacs-lisp
      (add-to-list 'auto-mode-alist '("\\.yml$" . yaml-mode))
      (add-to-list 'auto-mode-alist '("\\.yaml$" . yaml-mode))
    #+end_src
*** JavaScript Mode
    =js-mode= defaults to using 4 spaces for indentation. Change it to 2
    #+begin_src emacs-lisp
      (defun js-custom ()
        "js-mode-hook"
        (setq js-indent-level 2))

      (add-hook 'js-mode-hook 'js-custom)
    #+end_src
*** Markdown Mode
    Enable Markdown mode and setup additional file extensions. Use
    pandoc to generate HTML previews from within the mode, and use a
    custom css file to make it a little prettier.
    #+begin_src emacs-lisp
      (add-to-list 'auto-mode-alist '("\\.md$" . markdown-mode))
      (add-to-list 'auto-mode-alist '("\\.mdown$" . markdown-mode))
      (add-hook 'markdown-mode-hook
                (lambda ()
                  (visual-line-mode t)
                  (writegood-mode t)
                  (flyspell-mode t)))
      (setq markdown-command "pandoc --smart -f markdown -t html")
      (setq markdown-css-paths `(,(expand-file-name "markdown.css" abedra/vendor-dir)))
    #+end_src
*** Themes
    Load solarized-light if in a graphical environment. Load the
    wombat theme if in a terminal.
    #+begin_src emacs-lisp
      (if window-system
          (load-theme 'solarized-light t)
        (load-theme 'wombat t))
    #+end_src
*** Color Codes
    Running things like RSpec in compilation mode produces ansi color
    codes that aren't properly dealt with by default. This takes care
    of that and makes sure that the colors that are trying to be
    presented are rendered correctly.
    #+begin_src emacs-lisp
      (require 'ansi-color)
      (defun colorize-compilation-buffer ()
        (toggle-read-only)
        (ansi-color-apply-on-region (point-min) (point-max))
        (toggle-read-only))
      (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
#+end_src
